app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "103745851395922571363"]]
UPDATE "users" SET "token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["token", "ya29.TAEzxO9hmriqwFtsLkecgvElSHeByzl17qMT7nxVmFv5hrhAUWsHI_YsubPylbGgyEwl0kuBTPPaVw"], ["updated_at", "2015-04-05 13:32:07.274207"], ["id", 1]]
---
  def create
    auth = request.env['omniauth.auth']
    user = User.find_or_initialize_by(uid: auth['uid'])
    user.token = auth['credentials']['token']
    user.name = auth['info']['name']
    user.save