app/controllers/video_uploads_controller.rb

  def create
    @video_upload = VideoUpload.new(title: params[:video_upload][:title], description: params[:video_upload][:description], file: params[:video_upload][:file].try(:tempfile).try(:to_path))

    if @video_upload.save
---
INSERT INTO "videos" ("link", "uid", "title", "likes", "dislikes", "published_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)